In [1]:
print('halo ikmal')

halo ikmal

In [3]:
pwd #cek kita ada di directory mana

'C:\\Users\\ikmal\\Coding\\Machine Learning'

In [4]:
import os

# Cek isi direktori saat ini
print("Current Directory:", os.getcwd())  # Menampilkan path direktori saat ini
print("Isi Directory:")
print(os.listdir())  # Menampilkan semua file dan folder di direktori saat ini

Current Directory: C:\Users\ikmal\Coding\Machine Learning
Isi Directory:
['.ipynb_checkpoints', 'gagal.ipynb', 'Pandas as pd csv.ipynb', 'vgsales.csv']

In [6]:
ls #mengecek isi folder directory

 Volume in drive C is Windows-SSD
 Volume Serial Number is 107A-ABC8

 Directory of C:\Users\ikmal\Coding\Machine Learning

06/01/2025  15:25    <DIR>          .
06/01/2025  13:27    <DIR>          ..
06/01/2025  15:21    <DIR>          .ipynb_checkpoints
06/01/2025  14:46             8.897 gagal.ipynb
06/01/2025  15:25             2.803 Pandas as pd csv.ipynb
06/01/2025  14:09    <DIR>          vgsales.csv
               2 File(s)         11.700 bytes
               4 Dir(s)  290.861.010.944 bytes free

In [86]:
import pandas as pd
kapal_titanic = pd.read_csv('kapal_titanic.csv')
kapal_titanic
#membaca file csv dengan syarat file csv harus sama lokasinya

     survived  pclass     sex   age  sibsp  parch     fare embarked deck
0           0       3    male  22.0      1      0   7.2500        S  NaN
1           1       1  female  38.0      1      0  71.2833        C    C
2           1       3  female  26.0      0      0   7.9250        S  NaN
3           1       1  female  35.0      1      0  53.1000        S    C
4           0       3    male  35.0      0      0   8.0500        S  NaN
..        ...     ...     ...   ...    ...    ...      ...      ...  ...
886         0       2    male  27.0      0      0  13.0000        S  NaN
887         1       1  female  19.0      0      0  30.0000        S    B
888         0       3  female   NaN      1      2  23.4500        S  NaN
889         1       1    male  26.0      0      0  30.0000        C    C
890         0       3    male  32.0      0      0   7.7500        Q  NaN

[891 rows x 9 columns]

In [80]:
kapal_titanic.shape

(891, 9)

In [82]:
kapal_titanic.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [84]:
kapal_titanic.values

array([[0, 3, 'male', ..., 7.25, 'S', nan],
       [1, 1, 'female', ..., 71.2833, 'C', 'C'],
       [1, 3, 'female', ..., 7.925, 'S', nan],
       ...,
       [0, 3, 'female', ..., 23.45, 'S', nan],
       [1, 1, 'male', ..., 30.0, 'C', 'C'],
       [0, 3, 'male', ..., 7.75, 'Q', nan]], dtype=object)